<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        DB::statement("
       INSERT INTO `devices` (`type`, `name`, `company`, `capacity`, `ram`, `color`, `price`, `accessories`) VALUES
       ('MOBILE', 'آيفون 14', 'آبل', 128, 6, 'أرجواني سادة', 2419, 'لايوجد'),
       ('MOBILE', 'آيفون 14 برو ماكس', 'آبل', 128, 6, 'بنفسجي داكن', 4510, 'لايوجد'),
       ('MOBILE', 'جالاكسي فولد', 'سامسونغ', 512, 12, 'فضي', 6800, 'لايوجد'),
       ('MOBILE', 'ون بلس', 'ون بلس ', 512, 16, 'Flowy', 2599, 'لايوجد'),
       ('MOBILE', 'جالاكسيs21', 'سامسونغ', 128, 12, 'أسود فانتوم', 1224, 'لايوجد'),
       ('MOBILE', 'ريد ماك 8 برو', 'ون بلس ', 512, 16, 'Void', 3275, 'لايوجد'),
       ('MOBILE', 'جالاكسي A54', 'سامسونغ', 128, 8, 'Awesome Graphite', 1030, 'لايوجد'),
       ('MOBILE', 'بلاس برو 11', 'ريل مي ', 512, 12, 'Oasis Green', 1399, 'لايوجد'),
       ('MOBILE', 'جالاكسي ألترا s22 ', 'سامسونغ', 256, 12, 'أسود فانتوم', 2700, 'قلم إلكتروني'),
       ('MOBILE', 'جالاكسي s20 ألترا', 'سامسونغ', 128, 12, 'أسود كوزميك', 1400, 'لايوجد'),
       ('MOBILE', 'ريد ماجيك 8s برو', 'زيد تي أي ', 512, 16, 'بلاتينيوم', 3495, 'لايوجد'),
       ('MOBILE', 'بلاس برو11', 'ريل مي ', 512, 12, 'sunrise Beige', 1199, 'لايوجد'),
       ('MOBILE', 'ون بلاس12', 'ون بلس ', 512, 16, 'أسود', 2549, 'لايوجد'),
       ('MOBILE', 'جالاكسي نوت 20 ألترا', 'سامسونغ', 256, 8, 'برونزي ميستيك', 1850, 'قلم إلكتروني'),
       ('MOBILE', 'جالاكسي s22 ألترا', 'سامسونغ', 256, 12, 'أبيض فانتوم', 2628, 'قلم إلكتروني'),
       ('MOBILE', 'بلاس برو 11', 'ريل مي ', 512, 12, 'أخضر', 1199, 'لايوجد'),
       ('MOBILE', 'نوت20ألترا', 'سامسونغ', 256, 12, 'أبيض مستيك', 1590, 'لايوجد'),
       ('MOBILE', 'جالاكسي اس24', 'سامسونغ', 256, 12, 'رمادي', 3889, 'قلم إلكتروني'),
       ('MOBILE', 'بوكيت بي50', 'هواوي', 512, 12, 'ذهبي', 2999, 'لايوجد'),
       ('MOBILE', 'جالاكسي اس 23 ألترا', 'سامسونغ', 256, 12, 'أخضر', 3010, 'قلم إلكتروني'),
       ('MOBILE', 'آيفون 15برو ماكس', 'آبل', 256, 8, 'Natural Titanium', 4394, 'لايوجد'),
       ('MOBILE', 'آيفون13برو ماكس', 'آبل', 128, 6, 'أزرق سييرا', 2317, 'لايوجد'),
       ('MOBILE', 'سي55', 'ريل مي ', 256, 8, 'Rainy night', 509, 'لايوجد'),
       ('MOBILE', 'جالاكسي اس 20', 'سامسونغ', 128, 12, 'رمادي كوزميك', 1139, 'لايوجد'),
       ('MOBILE', 'سي53', 'ريل مي ', 128, 4, 'أسود مايتي', 399, 'لايوجد'),
       ('MOBILE', 'بي60 برو ', 'هواوي', 256, 8, 'Rococo Pearl', 2499, 'لايوجد'),
       ('MOBILE', 'إكس 9 بي ', 'هونور', 256, 12, 'Sunrise Orange', 1079, 'لايوجد'),
       ('MOBILE', 'Remo 11 pro', 'أوبو', 512, 12, 'Rock grey', 1814, 'لايوجد'),
       ('MOBILE', 'p80', 'كوبوت', 256, 16, 'أسود', 520, 'لايوجد'),
       ('MOBILE', 'آيفون 14 بلس', 'آبل', 128, 12, 'ميدنايت', 2797, 'لايوجد'),

       ('TABLET','تاب8', 'بلاكفيو', '64', '4', 'ذهبي', '399', 'لايوجد'),
       ('TABLET','سمارت تابل', 'أوميو', '256', '8', 'أسود', '309', 'غطاء جلدي+لوحة مفاتيح+ماوس'),
       ('TABLET','جي10', 'عربست', '16', '2', 'أسود', '145', 'قلم إلكتروني'),
       ('TABLET','100ماك', 'ماركة غير محددة', '16', '2', 'وردي', '17', 'لايوجد'),
       ('TABLET','جهاز لوحي قابل للطي', 'ماركة غير محددة', '12', '4', 'أحمر', '12.1', 'قلم إلكتروني'),
       ('TABLET','جهاز لوحي مريح للأطفال 524463785555', 'ماركة غير محددة', '2', '2', 'متعدد الألوان', '8', 'قلم إلكتروني'),
       ('TABLET','Atouch K Sries', 'أتتش', '16', '2', 'أزرق', '134.95', 'ساعة إلكترونية'),
       ('TABLET','مي ليسد', 'شاومي', '12', '2', 'أبيض', '56', 'قلم إلكتروني'),
       ('TABLET','نيو 1060بلاس', 'هيون', '16', '2', 'أسود', '239', 'قلم إلكتروني +سماعات'),
       ('TABLET','جالاكسي تاب', 'سامسونغ', '32', '2', 'أسود', '429', 'قلم إلكتروني'),
       ('TABLET','حامل ثلاثي القوائم ', 'روبيك', '12', '2', 'أسود', '32', 'لايوجد'),
       ('TABLET','سمارت تابل بي سي ', 'أوميو', '128', '6', 'أسود', '274.55', 'قلم إلكتروني'),
       ('TABLET','سمارت تابل', 'أوميو', '256', '8', 'رمادي', '308', 'لوحة مفاتيح+ماوس'),
       ('TABLET','فيتش تيني ', 'في تك', '12', '2', 'أبيض', '80', 'لايوجد'),
       ('TABLET','LCD', 'ماركة غير محددة', '12', '2', 'رمادي', '48.9', 'قلم إلكتروني'),
       ('TABLET','سي دي', 'بي اس ان ال', '12', '2', 'أسود', '19.9', 'قلم إلكتروني'),
       ('TABLET','آيباد برو 2022', 'آبل', '128', '64', 'رمادي', '2759', 'قلم إلكتروني '),
       ('TABLET','باد6تابلت', 'شاومي', '256', '8', 'رمادي داكن', '1008', '2 قلم إلكتروني '),
       ('TABLET','ايباد2022', 'آبل', '64', '8', 'أزرق', '1418.3', 'لايوجد'),
       ('TABLET','مات باد 11.5', 'هواوي', '256', '64', 'space Gray', '1299', 'قلم إلكتروني'),
       ('TABLET','باد اكس 9', 'هونور', '128', '4', 'أسود', '678', 'قلم إلكتروني'),
       ('TABLET','ايباد 2021', 'آبل', '64', '12', 'رمادي فلكي', '1020', 'قلم إلكتروني '),
       ('TABLET','تابلت مي باد5', 'شاومي', '128', '6', 'ابيض لؤلؤي ', '1030', '2قلم إلكتروني'),
       ('TABLET','ايباد Air2022 ', 'آبل', '64', '12', 'أرجواني', '1739', 'قلم إلكتروني '),
       ('TABLET','ام 10بلس', 'لينوفو', '64', '4', 'أزرق', '529', 'لايوجد'),
       ('TABLET','ايباد ميني ', 'آبل', '65', '8', 'بنفسجي', '1649', 'قلم إلكتروني '),
       ('TABLET','ميتا باد اس أي ', 'هواوي', '4', '2', 'أسود', '480', 'لايوجد'),
       ('TABLET','جالاكسي تاب اس9 جرافيت', 'سامسونغ', '128', '8', 'غرافيت', '2199', 'قلم إلكتروني '),
       ('TABLET','تابليت ميت باد الجديد 2022', 'هواوي', '64', '4', 'رمادي غير لامع ', '650', 'لايوجد'),
       ('TABLET','جالاكسي تاب A7', 'سامسونغ', '32', '3', 'رمادي', '515', 'لايوجد'),
       ('TABLET','ريدمي باد ', 'شاومي', '128', '6', 'أخضر نعناعي', '704', 'لايوجد'),
       ('TABLET','باد5 ', 'شاومي', '128', '6', 'رمادي كوني', '888', 'لايوجد'),
       ('TABLET','باد11.6انتش', 'ون بلس', '256', '12', 'أسود', '1698.95', 'قلم إلكتروني'),
       ('TABLET','انتش 12', 'سي ايديا', '512', '8', 'رمادي', '295', 'قلم إلكتروني+لوحة مفاتيح ');
       ");


       DB::statement("INSERT INTO `tech`.`devices` (`name`, `company`, `hard_disk`, `graphics_card`, `color`, `price`, `accessories`, `ram`)
        VALUES
       ('ميتا بوك D15', 'نوت بوك', 'ssd', 'intel iris', 'فضي فاتح ', '2699', 'شاحن ', '8'),
       ('ميتا بوكD16', 'هواوي', 'ssd', 'intel iser xe Graphics', 'Mystic Silver', '3059', 'شنطة ظهر', '16'),
       ('ميتا بوك 14', 'هواوي', 'ssd', 'intel iser xe Graphics', 'Mystic Silver', '3149.1', 'شنطة ظهر', '8'),
       ('ماك بوك اير MGN63', 'آبل', 'ssd', 'M2 chip/Gpu', 'رمادي', '3299', 'شنطة ظهر', '8'),
       ('15sfq5003nx', 'hp', 'ssd', 'AMD Radeon Graphics', 'Natural Silver', '2649', 'شنطة ظهر', '8'),
       ('ماك بوك اير MGN93', 'آبل', 'ssd', 'AMD Radeon Graphics', 'فضي فضي ', '3299', 'شنطة ظهر', '8'),
       ('E510MABR997WS', 'أسوس', 'ssd', 'intel uhd graphics', 'أسود', '849', 'شنطة ظهر', '4'),
       ('G9', 'hp', 'ssd', 'AMD Radeon Graphics', 'Asteriod Silver', '1545', 'شنطة ظهر', '8'),
       ('pavilion x360', 'hp', 'ssd', 'intel iser xe Graphics', 'Natural Silver', '3675', 'قلم إلكتروني +شنطة ظهر', '8'),
       ('ماك بوك برو', 'آبل', 'ssd', 'Gpu', 'فضي', '5299', 'شنطة ظهر', '8'),
       ('Vivobook', 'أسوس ', 'ssd', 'intel uhd graphics', 'Transparent Silver', '2299', 'شنطة ظهر', '8'),
       ('Modern ', 'أم اس أي', 'ssd', 'intel iris xe ', 'أسود', '1690', 'شنطة ظهر', '8'),
       ('Aspire7A715', 'أيسر', 'ssd', 'intel', 'أسود', '1949', 'شنطة ظهر', '8'),
       ('بريداتور هيليوس نيو16', 'أيسر', 'ssd', 'انفيديا جي فورس ار تي اكس 4060', 'أسود', '459', 'شنطة ظهر', '16'),
       ('تي يو اف f15', 'أسس', 'ssd', 'rtx4070', 'رمادي ميكا', '4598', 'شنطة ظهر', '8'),
       ('ليجن5', 'لينوفو', 'ssd', 'Rtx3070', 'أزرق فانتيوم', '1999', 'شنطة ظهر', '16'),
       ('نوت بوك نيتو في 15', 'أيسر', 'ssd', 'rtx3050', 'أسود', '1999', 'شنطة ظهر', '16'),
       ('dw3028nx', 'hp', 'ssd', 'nvidia geforce mx350', 'رمادي', '1949', 'شنطة ظهر', '8'),
       ('E510MABR997WS', 'اسوس', 'ssd', 'intel', 'أسود', '849', 'شنطة ظهر', '4'),
       ('أي ماك', 'آبل', 'ssd', 'كور 7 ', 'وردي', '4499', 'شنطة ظهر', '8'),
       ('جي8 ', 'hp', 'ssd', 'AMD Radeon vega', 'أسود', '1699', 'شنطة ظهر', '8'),
       ('أسباير3', 'أيسر', 'sdd', 'nvidia geforce mx450', 'رمادي', '1899', 'شنطة ظهر', '8'),
       ('G8 205', 'hp', 'ssd', 'AMD Radeon vega', 'رمادي', '1699', 'شنطة ظهر', '8'),
       ('Aspire 7A', 'أيسر', 'ssd', 'gtx1650', 'أسود', '1949', 'شنطة ظهر', '4'),
       ('G8255', 'hp', 'ssd', 'AMD Radeon vega', 'رمادي', '1545', 'شنطة ظهر', '8'),
       ('ميتا بوكD14', 'هواوي', 'ssd', 'intel iser xe Graphics', 'Mystic Silver', '1999', 'شنطة ظهر', '16')
      ");
    }
}
